openfoam2412-cases/waveMakerPiston/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottom1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       195160;
    }
    bottom2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       195260;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          98000;
        startFace       195860;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          98000;
        startFace       293860;
    }
    leftwall
    {
        type            patch;
        nFaces          140;
        startFace       391860;
    }
    rightwall
    {
        type            patch;
        nFaces          140;
        startFace       392000;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          700;
        startFace       392140;
    }
)

// ************************************************************************* //
