openfoam2412-cases/waveMakerPiston/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
   (0  0     0)     //0
   (2  0     0)     //1
   (2  0     0.7)   //2
   (0  0     0.7)   //3 
   (0  0.01  0)     //4
   (2  0.01  0)     //5
   (2  0.01  0.7)   //6
   (0  0.01  0.7)   //7
   (8  0     0)     //8
   (8  0     0.7)   //9
   (8  0.01  0.7)   //10
   (8  0.01  0)     //11
);

blocks
(
    hex (0 1 5 4 3 2 6 7)   (100 1 140) simpleGrading (1 1 1)
    hex (1 8 11 5 2 9 10 6)   (600 1 140) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom1
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    bottom2
    {
        type wall;
        faces
        (
            (1 8 11 5)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 8 9 2)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (5 11 10 6)
        );
    }
    leftwall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    rightwall
    {
        type patch;
        faces
        (
            (8 11 10 9)
        );
    }
    top
    {
        type wall;
        faces
        (
            (3 2 6 7)
            (2 9 10 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
